### Terraform `plan` Succeeded for Workspace: `default`
<details open><summary>Show Output</summary>

```diff
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.backend.azurerm_resource_group.backend_rg has been deleted
-   resource "azurerm_resource_group" "backend_rg" {
-       id       = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/BackendRG" -> null
-       location = "uksouth" -> null
-       name     = "BackendRG" -> null
-       tags     = {
-           "CommonTag1" = "demo1"
-           "CommonTag2" = "This is a demo"
-           "Purpose"    = "Terraform-Backend-Resource-Group-Development"
        } -> null
    }

  # module.backend.azurerm_resource_group.primary_rg has been deleted
-   resource "azurerm_resource_group" "primary_rg" {
-       id       = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/PrimaryRG" -> null
-       location = "uksouth" -> null
-       name     = "PrimaryRG" -> null
-       tags     = {
-           "CommonTag1" = "demo1"
-           "CommonTag2" = "This is a demo"
-           "Purpose"    = "Terraform-Primary-Resource-Group-Development"
        } -> null
    }

  # module.backend.azurerm_role_definition.terraform_role has changed
!   resource "azurerm_role_definition" "terraform_role" {
        id                          = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/providers/Microsoft.Authorization/roleDefinitions/74d7c518-c37e-eb87-c4aa-534aee03db0b|/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed"
        name                        = "terraform-contributor"
        # (5 unchanged attributes hidden)

!       permissions {
+           data_actions     = []
+           not_data_actions = []
            # (2 unchanged attributes hidden)
        }
    }

  # module.backend.azurerm_storage_account.backend_sa has been deleted
-   resource "azurerm_storage_account" "backend_sa" {
-       access_tier                       = "Hot" -> null
-       account_kind                      = "BlobStorage" -> null
-       account_replication_type          = "LRS" -> null
-       account_tier                      = "Standard" -> null
-       allow_blob_public_access          = false -> null
-       enable_https_traffic_only         = true -> null
-       id                                = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/BackendRG/providers/Microsoft.Storage/storageAccounts/pwd9000sa4980" -> null
-       infrastructure_encryption_enabled = false -> null
-       is_hns_enabled                    = false -> null
-       location                          = "uksouth" -> null
-       min_tls_version                   = "TLS1_2" -> null
-       name                              = "pwd9000sa4980" -> null
-       nfsv3_enabled                     = false -> null
-       primary_access_key                = (sensitive value)
-       primary_blob_connection_string    = (sensitive value)
-       primary_blob_endpoint             = "https://pwd9000sa4980.blob.core.windows.net/" -> null
-       primary_blob_host                 = "pwd9000sa4980.blob.core.windows.net" -> null
-       primary_connection_string         = (sensitive value)
-       primary_dfs_endpoint              = "https://pwd9000sa4980.dfs.core.windows.net/" -> null
-       primary_dfs_host                  = "pwd9000sa4980.dfs.core.windows.net" -> null
-       primary_location                  = "uksouth" -> null
-       primary_table_endpoint            = "https://pwd9000sa4980.table.core.windows.net/" -> null
-       primary_table_host                = "pwd9000sa4980.table.core.windows.net" -> null
-       queue_encryption_key_type         = "Service" -> null
-       resource_group_name               = "BackendRG" -> null
-       secondary_access_key              = (sensitive value)
-       secondary_connection_string       = (sensitive value)
-       shared_access_key_enabled         = true -> null
-       table_encryption_key_type         = "Service" -> null
-       tags                              = {
-           "CommonTag1" = "demo1"
-           "CommonTag2" = "This is a demo"
-           "NewTag2"    = "last2"
-           "Purpose"    = "Backend-State-Storage-Development"
-           "Tag1"       = "first1"
        } -> null

-       blob_properties {
-           change_feed_enabled      = false -> null
-           last_access_time_enabled = false -> null
-           versioning_enabled       = false -> null
        }

-       network_rules {
-           bypass                     = [
-               "AzureServices",
            ] -> null
-           default_action             = "Allow" -> null
-           ip_rules                   = [] -> null
-           virtual_network_subnet_ids = [] -> null
        }
    }

  # module.backend.azurerm_storage_container.backend_sa_container has been deleted
-   resource "azurerm_storage_container" "backend_sa_container" {
-       container_access_type   = "private" -> null
-       has_immutability_policy = false -> null
-       has_legal_hold          = false -> null
-       id                      = "https://pwd9000sa4980.blob.core.windows.net/backend-remote-state" -> null
-       metadata                = {} -> null
-       name                    = "backend-remote-state" -> null
-       resource_manager_id     = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/BackendRG/providers/Microsoft.Storage/storageAccounts/pwd9000sa4980/blobServices/default/containers/backend-remote-state" -> null
-       storage_account_name    = "pwd9000sa4980" -> null
    }

  # module.backend.azurerm_storage_container.primary_sa_container has been deleted
-   resource "azurerm_storage_container" "primary_sa_container" {
-       container_access_type   = "private" -> null
-       has_immutability_policy = false -> null
-       has_legal_hold          = false -> null
-       id                      = "https://pwd9000sa4980.blob.core.windows.net/primary-remote-state" -> null
-       metadata                = {} -> null
-       name                    = "primary-remote-state" -> null
-       resource_manager_id     = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/resourceGroups/BackendRG/providers/Microsoft.Storage/storageAccounts/pwd9000sa4980/blobServices/default/containers/primary-remote-state" -> null
-       storage_account_name    = "pwd9000sa4980" -> null
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # module.backend.azuread_application.terraform_app will be created
+   resource "azuread_application" "terraform_app" {
+       app_role_ids                = (known after apply)
+       application_id              = (known after apply)
+       disabled_by_microsoft       = (known after apply)
+       display_name                = "terraform-SPN"
+       id                          = (known after apply)
+       logo_url                    = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       object_id                   = (known after apply)
+       prevent_duplicate_names     = false
+       publisher_domain            = (known after apply)
+       sign_in_audience            = "AzureADMyOrg"
+       tags                        = (known after apply)
+       template_id                 = (known after apply)

+       feature_tags {
+           custom_single_sign_on = (known after apply)
+           enterprise            = (known after apply)
+           gallery               = (known after apply)
+           hide                  = (known after apply)
        }
    }

  # module.backend.azuread_service_principal.terraform_app_sp will be created
+   resource "azuread_service_principal" "terraform_app_sp" {
+       account_enabled             = true
+       app_role_ids                = (known after apply)
+       app_roles                   = (known after apply)
+       application_id              = (known after apply)
+       application_tenant_id       = (known after apply)
+       display_name                = (known after apply)
+       homepage_url                = (known after apply)
+       id                          = (known after apply)
+       logout_url                  = (known after apply)
+       oauth2_permission_scope_ids = (known after apply)
+       oauth2_permission_scopes    = (known after apply)
+       object_id                   = (known after apply)
+       redirect_uris               = (known after apply)
+       saml_metadata_url           = (known after apply)
+       service_principal_names     = (known after apply)
+       sign_in_audience            = (known after apply)
+       tags                        = (known after apply)
+       type                        = (known after apply)

+       feature_tags {
+           custom_single_sign_on = (known after apply)
+           enterprise            = (known after apply)
+           gallery               = (known after apply)
+           hide                  = (known after apply)
        }

+       features {
+           custom_single_sign_on_app = (known after apply)
+           enterprise_application    = (known after apply)
+           gallery_application       = (known after apply)
+           visible_to_users          = (known after apply)
        }
    }

  # module.backend.azuread_service_principal_password.terraform_app_sp_pwd will be created
+   resource "azuread_service_principal_password" "terraform_app_sp_pwd" {
+       display_name         = (known after apply)
+       end_date             = (known after apply)
+       id                   = (known after apply)
+       key_id               = (known after apply)
+       service_principal_id = (known after apply)
+       start_date           = (known after apply)
+       value                = (sensitive value)
    }

  # module.backend.azurerm_key_vault.backend_kv will be created
+   resource "azurerm_key_vault" "backend_kv" {
+       access_policy                   = [
+           {
+               application_id          = null
+               certificate_permissions = []
+               key_permissions         = []
+               object_id               = (known after apply)
+               secret_permissions      = [
+                   "get",
+                   "list",
                ]
+               storage_permissions     = []
+               tenant_id               = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
            },
+           {
+               application_id          = null
+               certificate_permissions = []
+               key_permissions         = []
+               object_id               = "4300fc00-0311-4b58-9eca-6e871df84c82"
+               secret_permissions      = [
+                   "backup",
+                   "delete",
+                   "purge",
+                   "recover",
+                   "restore",
+                   "set",
+                   "get",
+                   "list",
                ]
+               storage_permissions     = []
+               tenant_id               = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
            },
        ]
+       enabled_for_deployment          = false
+       enabled_for_disk_encryption     = false
+       enabled_for_template_deployment = false
+       id                              = (known after apply)
+       location                        = "uksouth"
+       name                            = "pwd9000kv4980"
+       purge_protection_enabled        = false
+       resource_group_name             = "BackendRG"
+       sku_name                        = "standard"
+       soft_delete_enabled             = (known after apply)
+       soft_delete_retention_days      = 7
+       tags                            = {
+           "CommonTag1" = "demo1"
+           "CommonTag2" = "This is a demo"
+           "Purpose"    = "Backend-Key-Vault-Development"
        }
+       tenant_id                       = "b4fd7cff-510b-4da5-b133-f7aa6f692ee2"
+       vault_uri                       = (known after apply)

+       network_acls {
+           bypass                     = (known after apply)
+           default_action             = (known after apply)
+           ip_rules                   = (known after apply)
+           virtual_network_subnet_ids = (known after apply)
        }
    }

  # module.backend.azurerm_key_vault_secret.terraform_client_id will be created
+   resource "azurerm_key_vault_secret" "terraform_client_id" {
+       content_type   = "ARM_CLIENT_ID"
+       id             = (known after apply)
+       key_vault_id   = (known after apply)
+       name           = "tf-arm-client-id"
+       tags           = {
+           "CommonTag1" = "demo1"
+           "CommonTag2" = "This is a demo"
+           "Purpose"    = "Terraform-Service-Principal-Application-ID"
        }
+       value          = (sensitive value)
+       version        = (known after apply)
+       versionless_id = (known after apply)
    }

  # module.backend.azurerm_key_vault_secret.terraform_client_secret will be created
+   resource "azurerm_key_vault_secret" "terraform_client_secret" {
+       content_type   = "ARM_CLIENT_SECRET"
+       id             = (known after apply)
+       key_vault_id   = (known after apply)
+       name           = "tf-arm-client-secret"
+       tags           = {
+           "CommonTag1" = "demo1"
+           "CommonTag2" = "This is a demo"
+           "Purpose"    = "Terraform-Service-Principal-Application-Secret"
        }
+       value          = (sensitive value)
+       version        = (known after apply)
+       versionless_id = (known after apply)
    }

  # module.backend.azurerm_resource_group.backend_rg will be created
+   resource "azurerm_resource_group" "backend_rg" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "BackendRG"
+       tags     = {
+           "CommonTag1" = "demo1"
+           "CommonTag2" = "This is a demo"
+           "Purpose"    = "Terraform-Backend-Resource-Group-Development"
        }
    }

  # module.backend.azurerm_resource_group.primary_rg will be created
+   resource "azurerm_resource_group" "primary_rg" {
+       id       = (known after apply)
+       location = "uksouth"
+       name     = "PrimaryRG"
+       tags     = {
+           "CommonTag1" = "demo1"
+           "CommonTag2" = "This is a demo"
+           "Purpose"    = "Terraform-Primary-Resource-Group-Development"
        }
    }

  # module.backend.azurerm_role_assignment.primary_rg_ra will be created
+   resource "azurerm_role_assignment" "primary_rg_ra" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = "/subscriptions/259b6576-f261-472e-ad18-e24b1a3ef2ed/providers/Microsoft.Authorization/roleDefinitions/74d7c518-c37e-eb87-c4aa-534aee03db0b"
+       role_definition_name             = (known after apply)
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.backend.azurerm_role_assignment.primary_sa_container_ra will be created
+   resource "azurerm_role_assignment" "primary_sa_container_ra" {
+       id                               = (known after apply)
+       name                             = (known after apply)
+       principal_id                     = (known after apply)
+       principal_type                   = (known after apply)
+       role_definition_id               = (known after apply)
+       role_definition_name             = "Storage Blob Data Contributor"
+       scope                            = (known after apply)
+       skip_service_principal_aad_check = (known after apply)
    }

  # module.backend.azurerm_storage_account.backend_sa will be created
+   resource "azurerm_storage_account" "backend_sa" {
+       access_tier                       = "Hot"
+       account_kind                      = "BlobStorage"
+       account_replication_type          = "LRS"
+       account_tier                      = "Standard"
+       allow_blob_public_access          = false
+       enable_https_traffic_only         = true
+       id                                = (known after apply)
+       infrastructure_encryption_enabled = false
+       is_hns_enabled                    = false
+       large_file_share_enabled          = (known after apply)
+       location                          = "uksouth"
+       min_tls_version                   = "TLS1_2"
+       name                              = "pwd9000sa4980"
+       nfsv3_enabled                     = false
+       primary_access_key                = (sensitive value)
+       primary_blob_connection_string    = (sensitive value)
+       primary_blob_endpoint             = (known after apply)
+       primary_blob_host                 = (known after apply)
+       primary_connection_string         = (sensitive value)
+       primary_dfs_endpoint              = (known after apply)
+       primary_dfs_host                  = (known after apply)
+       primary_file_endpoint             = (known after apply)
+       primary_file_host                 = (known after apply)
+       primary_location                  = (known after apply)
+       primary_queue_endpoint            = (known after apply)
+       primary_queue_host                = (known after apply)
+       primary_table_endpoint            = (known after apply)
+       primary_table_host                = (known after apply)
+       primary_web_endpoint              = (known after apply)
+       primary_web_host                  = (known after apply)
+       queue_encryption_key_type         = "Service"
+       resource_group_name               = "BackendRG"
+       secondary_access_key              = (sensitive value)
+       secondary_blob_connection_string  = (sensitive value)
+       secondary_blob_endpoint           = (known after apply)
+       secondary_blob_host               = (known after apply)
+       secondary_connection_string       = (sensitive value)
+       secondary_dfs_endpoint            = (known after apply)
+       secondary_dfs_host                = (known after apply)
+       secondary_file_endpoint           = (known after apply)
+       secondary_file_host               = (known after apply)
+       secondary_location                = (known after apply)
+       secondary_queue_endpoint          = (known after apply)
+       secondary_queue_host              = (known after apply)
+       secondary_table_endpoint          = (known after apply)
+       secondary_table_host              = (known after apply)
+       secondary_web_endpoint            = (known after apply)
+       secondary_web_host                = (known after apply)
+       shared_access_key_enabled         = true
+       table_encryption_key_type         = "Service"
+       tags                              = {
+           "CommonTag1" = "demo1"
+           "CommonTag2" = "This is a demo"
+           "Purpose"    = "Backend-State-Storage-Development"
        }

+       blob_properties {
+           change_feed_enabled      = (known after apply)
+           default_service_version  = (known after apply)
+           last_access_time_enabled = (known after apply)
+           versioning_enabled       = (known after apply)

+           container_delete_retention_policy {
+               days = (known after apply)
            }

+           cors_rule {
+               allowed_headers    = (known after apply)
+               allowed_methods    = (known after apply)
+               allowed_origins    = (known after apply)
+               exposed_headers    = (known after apply)
+               max_age_in_seconds = (known after apply)
            }

+           delete_retention_policy {
+               days = (known after apply)
            }
        }

+       network_rules {
+           bypass                     = (known after apply)
+           default_action             = (known after apply)
+           ip_rules                   = (known after apply)
+           virtual_network_subnet_ids = (known after apply)

+           private_link_access {
+               endpoint_resource_id = (known after apply)
+               endpoint_tenant_id   = (known after apply)
            }
        }

+       queue_properties {
+           cors_rule {
+               allowed_headers    = (known after apply)
+               allowed_methods    = (known after apply)
+               allowed_origins    = (known after apply)
+               exposed_headers    = (known after apply)
+               max_age_in_seconds = (known after apply)
            }

+           hour_metrics {
+               enabled               = (known after apply)
+               include_apis          = (known after apply)
+               retention_policy_days = (known after apply)
+               version               = (known after apply)
            }

+           logging {
+               delete                = (known after apply)
+               read                  = (known after apply)
+               retention_policy_days = (known after apply)
+               version               = (known after apply)
+               write                 = (known after apply)
            }

+           minute_metrics {
+               enabled               = (known after apply)
+               include_apis          = (known after apply)
+               retention_policy_days = (known after apply)
+               version               = (known after apply)
            }
        }

+       routing {
+           choice                      = (known after apply)
+           publish_internet_endpoints  = (known after apply)
+           publish_microsoft_endpoints = (known after apply)
        }

+       share_properties {
+           cors_rule {
+               allowed_headers    = (known after apply)
+               allowed_methods    = (known after apply)
+               allowed_origins    = (known after apply)
+               exposed_headers    = (known after apply)
+               max_age_in_seconds = (known after apply)
            }

+           retention_policy {
+               days = (known after apply)
            }

+           smb {
+               authentication_types            = (known after apply)
+               channel_encryption_type         = (known after apply)
+               kerberos_ticket_encryption_type = (known after apply)
+               versions                        = (known after apply)
            }
        }
    }

  # module.backend.azurerm_storage_container.backend_sa_container will be created
+   resource "azurerm_storage_container" "backend_sa_container" {
+       container_access_type   = "private"
+       has_immutability_policy = (known after apply)
+       has_legal_hold          = (known after apply)
+       id                      = (known after apply)
+       metadata                = (known after apply)
+       name                    = "backend-remote-state"
+       resource_manager_id     = (known after apply)
+       storage_account_name    = "pwd9000sa4980"
    }

  # module.backend.azurerm_storage_container.primary_sa_container will be created
+   resource "azurerm_storage_container" "primary_sa_container" {
+       container_access_type   = "private"
+       has_immutability_policy = (known after apply)
+       has_legal_hold          = (known after apply)
+       id                      = (known after apply)
+       metadata                = (known after apply)
+       name                    = "primary-remote-state"
+       resource_manager_id     = (known after apply)
+       storage_account_name    = "pwd9000sa4980"
    }

  # module.backend.null_resource.setup-log will be created
+   resource "null_resource" "setup-log" {
+       id = (known after apply)
    }

Plan: 14 to add, 0 to change, 0 to destroy.
```
</details>